Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: When reading a REG_MULTI_SZ key the multiple entries are separated by @LF - use with StringSplit(..., @LF) to get each entry.
fr: Lors de la lecture d'une clé de REG_MULTI_SZ les multiples entrées sont séparées par @LF - à utiliser avec StringSplit (..., @LF) pour obtenir chaque entrée.

source: The registry key to write to.
fr: La clé de registre à écrire.

source: If no other parameters are specified this key will simply be created.
fr: Si pas d'autre paramètre n'est spécifié cette clé sera simplement créée.

source: The valuename to write to.
fr: Le nom de la valeur à écrire.

source: Type of key to write:
fr: Type de clé à écrire:

source: "REG_SZ", "REG_MULTI_SZ", "REG_EXPAND_SZ", "REG_DWORD", "REG_QWORD", or "REG_BINARY".
fr: "REG_SZ", "REG_MULTI_SZ", "REG_EXPAND_SZ", "REG_DWORD", "REG_QWORD", ou "REG_BINARY".

source: The value to write.
fr: La valeur à écrire.

source: 0 and sets the @error flag to non-zero if error writing registry key or value.
fr: Retourne 0 et @error <> 0 s'il y a une erreur d'écriture dans la clé de registres ou dans la valeur.

source: When running on 64-bit Windows if you want to write a key or value specific to the 64-bit environment you have to suffix the HK... with 64 i.e.
fr: Lors de l'exécution sur Windows 64 bits si vous voulez écrire une clé ou une valeur spécifique à l'environnement 64 bits, vous devez suffixer HK ...avec 64 i.e.

source: When writing a REG_MULTI_SZ key you must separate each value with @LF.
fr: Lors de l'écriture d'une clé REG_MULTI_SZ vous devez séparer chaque valeur par @LF.

source: The value must NOT end with @LF unless you want an empty substring (see example).
fr: La valeur ne doit pas se terminer par @LF sauf si vous voulez une chaîne vide (Voir exemple).

source: Write a single REG_SZ value
fr: Donne une valeur REG_SZ unique

source: Write the REG_MULTI_SZ value of "line1" and "line2"
fr: Ecrit la valeur REG_MULTI_SZ de "ligne1" et "ligne2"

source: Write the REG_MULTI_SZ value of "line1"
fr: Ecrit la valeur REG_MULTI_SZ de "ligne1"

source: always add and extra null string
fr: toujours ajouter et chaîne à extra null

source: empty REG_MULTI_SZ
fr: vide REG_MULTI_SZ

source: create just the key
fr: crée la clé

source: Returns a number rounded to a specified number of decimal places.
fr: Arrondi un décimal avec un nombre spécifié de décimales.

source: Number indicating how many places to the right of the decimal are included in the rounding.If omitted, Round returns an integer.
fr: Nombre de déccimales à droite de la virgule.En cas d'omission, retourne un entier.

source: Returns rounded number.
fr: Retourne le nombre arrondis.

source: The decimalplaces parameter can be negative which allows you to round to the ones, tens, hundred, etc.place.
fr: Le paramètre decimalplaces peut être négatif pour vous permettre d'arrondir à la dizaine, à la centaine, etc...

source: Note that up to fifteen digits of a number are displayed, and note that decimalplaces will never pad a number with trailing zeros.
fr: Notez qu'au plus quinze chiffres d'un nombre sont affichés, et notez que decimalplaces ne comblera jamais les décimales avec des zéros.

source: Returns -1.6.
fr: Retourne -1.6.

source: No change is made.
fr: Aucun changement n'est effectué.

source: Returns 120
fr: Retourne 120

source: Assign a Local variable an Array which will contain the rounded numbers.
fr: Assigne une variable locale avec un tableau qui contiendra les nombres arrondis.

source: Returns 3.1415
fr: Retourne 3.1415

source: Returns 120.
fr: Retourne 120.

source: Returns 124.
fr: Retourne 124.

source: Returns 50.
fr: Retourne 50.

source: Runs an external program.
fr: Exécute un programme externe.

source: The full path of the program (EXE, BAT, COM, or PIF) to run (see remarks).
fr: Le chemin d'accès complet du programme ( EXE, BAT, COM, ou PIF ) à exécuter (Voir Remarques).

source: The working directory.
fr: Le répertoire de travail.

source: Blank ("") uses the current working directory.
fr: Vide ("" ) utilise le répertoire de travail courant.

source: This is not the path to the program.
fr: Ce n'est pas le chemin du programme.

source: The "show" flag of the executed program:
fr: Le flag "affichage" du programme exécuté:

source: @SW_HIDE = Hidden window (or Default keyword)
fr: SW_HIDE = Fenêtre cachée ( ou mot-clé Default)

source: @SW_MINIMIZE = Minimized window
fr: SW_MINIMIZE = Fenêtre réduite

source: @SW_MAXIMIZE = Maximized window
fr: SW_MAXIMIZE = Fenêtre maximisée

source: Controls various options related to how the parent and child process interact.
fr: Options diverses liées à la façon dont les processus parent-enfant inter-agissent.

source: 0x1 ($STDIN_CHILD) = Provide a handle to the child's STDIN stream
fr: 0x1 ($STDIN_CHILD) = Fournit un handle pour le flux STDIN de l'enfant

source: 0x2 ($STDOUT_CHILD) = Provide a handle to the child's STDOUT stream
fr: 0x2 ($STDOUT_CHILD) = Fournit un handle pour le flux STDOUT de l'enfant

source: 0x4 ($STDERR_CHILD) = Provide a handle to the child's STDERR stream
fr: 0x4 ($STDERR_CHILD) = Fournit un handle pour le flux STDERR de l'enfant

source: 0x8 ($STDERR_MERGED) = Provides the same handle for STDOUT and STDERR.
fr: 0x8 (STDERR_MERGED) = Fournit le même handle pour STDOUT et STDERR.

source: Implies both $STDOUT_CHILD and $STDERR_CHILD.
fr: Implique à la fois $STDOUT_CHILD et $STDERR_CHILD.

source: 0x10 ($STDIO_INHERIT_PARENT) = Provide the child with the parent's STDIO streams.
fr: 0x10 ($STDIO_INHERIT_PARENT) = Fournit l'enfant avec les flux STDIO du parent.

source: This flag can not be combined with any other STDIO flag.
fr: Ce drapeau ne peut être jumelée à aucun autre drapeau STDIO.

source: This flag is only useful when the parent is compiled as a Console application.
fr: Ce drapeau n'est utile que lorsque le parent est compilé comme une application Console.

source: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = The child console process should be created with it's own window instead of using the parent's window.
fr: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = Le processus de la console de l'enfant doit être créé avec sa propre fenêtre au lieu d'utiliser la fenêtre du parent.

source: the PID of the process that was launched.
fr: Retourne le PID du processus qui a été lancé.

source: Paths with spaces need to be enclosed in quotation marks.
fr: Les chemins qui contiennent des espaces doivent être placés entre guillemets.

source: To run DOS (console) commands, try Run(@ComSpec & " /c " & 'commandName', "", @SW_HIDE) ; don't forget " " before "/c"
fr: Pour exécuter les commandes DOS (console), essayez Run(@ComSpec & " /c " & 'commandName', "", @SW_HIDE) ; ne pas oublier l'espace " " avant "/c"

source: After running the requested program the script continues.
fr: Après avoir exécuté le programme demandé le script continue.

source: To pause execution of the script until the spawned program has finished use the RunWait() function instead.
fr: Pour mettre en pause l'exécution du script jusqu'à ce que le programme soit terminé, utilisez la fonction RunWait() à la place.

source: Providing the Standard I/O parameter with the proper values permits interaction with the child process through the StderrRead(), StdinWrite() and StdoutRead() functions.
fr: Fournir le paramètre Standard I/O avec les valeurs propres permet une interaction avec le processus enfant à travers les fonctions StderrRead(), StdinWrite() et StdoutRead().

source: Combine the flag values (or use $STDERR_CHILD, $STDIN_CHILD & $STDOUT_CHILD, defined in Constants.au3) to manage more than one stream.
fr: Combiner les valeurs des flags (ou utiliser $STDERR_CHILD, $STDIN_CHILD & STDOUT_CHILD, définis dans Constants.au3 ) pour gérer plus d'un flux.

source: In order for the streams to close, the following conditions must be met:
fr: Pour les flux de fermeture, les conditions suivantes doivent être remplies:

source: 1) The child process has closed its end of the stream (this happens when the child closes).
fr: 1) Le processus enfant a fermé la fin de son flux (ce qui arrive lorsque l'enfant ferme).

source: 2) AutoIt must read any captured streams until there is no more data.
fr: 2) AutoIt doit lire tous les flux capturés jusqu'à il n'y a pas plus de données.

source: 3) If STDIN is provided for the child, StdinWrite() must be called to close the stream.
fr: 3) Si STDIN est fourni pour l'enfant, StdinWrite() doit être appelée pour fermer le flux.

source: Once all streams are detected as no longer needed, all internal resources will automatically be freed.
fr: Une fois que tous les flux sont détectés comme n'étant plus nécessaires, toutes les ressources internes seront automatiquement libérés.

source: StdioClose() can be used to force the STDIO streams closed.
fr: StdioClose() peut être utilisé pour forcer le flux STDIO à se fermer.

source: Runs an external program under the context of a different user.
fr: Exécute un programme externe dans le contexte d'un autre utilisateur.

source: The username to log on with.
fr: Le nom d'utilisateur pour se connecter avec l'autre utilisateur.

source: The domain to authenticate against.
fr: Le domaine pour s'authentifier.

source: The password for the user.
fr: Le mot de passe de l'utilisateur.

source: 0 - Interactive logon with no profile.
fr: 0 - Ouverture de session interactive avec aucun profil.

source: 1 - Interactive logon with profile.
fr: 1 - Ouverture de session interactive avec un profil.

source: 2 - Network credentials only.
fr: 2 - Identification réseau uniquement.

source: 4 - Inherit the calling process's environment instead of the user's environment.
fr: 4 - Hériter l'environnement du processus appelant à la place de l'environnement de l'utilisateur.

source: If not specified, then the value of @SystemDir will be used.
fr: S'il n'est pas spécifié, la valeur de @SystemDir sera utilisée.

source: It is important to specify a working directory the user you are running as has access to, otherwise the function will fail.
fr: Il est important de spécifier un répertoire de travail accessible par l'utilisateur sur lequel vous exécutez le programme, sinon la fonction échouera.

source: It is recommended that you only load the user's profile is you are sure you need it.
fr: Il est recommandé que vous ne chargiez le profil de l'utilisateur que si vous êtes sûr d'en avoir besoin.

source: There is a small chance a profile can be stuck in memory under the right conditions.
fr: Il y a une petite chance qu'un profil soit bloqué en mémoire dans de bonnes conditions(?).

source: If a script using RunAs() happens to be running as the SYSTEM account (for example, if the script is running as a service) and the user's profile is loaded, then you must take care that the script remains running until the child process closes.
fr: Si un script qui exécute RunAs() arrive à être exécuté sous le compte SYSTEM (par exemple, si le script est exécuté en tant que service ) et que le profil de l'utilisateur est chargé, vous devez veiller à ce que le script continue de s'exécuter jusqu'à ce que le processus enfant se termine.

source: When running as an administrator, the Secondary Logon (RunAs()) service must be enabled or this function will fail.
fr: Lors de l'exécution en tant qu'administrateur, l'ouverture de session secondaire (RunAs()) service doit être activée ou cette fonction échouera.

source: This does not apply when running as the SYSTEM account.
fr: Ceci ne s'applique pas lors de l'exécution sous le compte SYSTEM.

source: To pause execution of the script until the spawned program has finished use the RunAsWait() function instead.
fr: Pour mettre en pause l'exécution du script jusqu'à ce que le programme soit terminé, utilisez la fonction RunAsWait() à la place.

source: The "load profile" and "network credentials only" options are incompatible.
fr: Les options "charger le profil" et "informations d'identification réseau seules" sont incompatibles.

source: Using both will produce undefined results.
fr: Les utiliser ensemble provoquera des résultats indéfinis.

source: There is an issue in the Windows XP generation of Windows which prevents STDIO redirection and the show flag from working.
fr: Il y a un problème dans la génération des Windows XP qui empêche la redirection STDIO et le flag "mode d' affichage" de fonctionner.

source: See Microsoft Knowledge Base article KB818858 for more information about which versions are affected as well as a hotfix for the issue.
fr: Consultez l'article de la la Base de connaissances Microsoft KB818858 pour plus d'informations sur quelles versions sont concernées ainsi que d'un correctif pour ce problème.

source: Users running Windows XP SP2 or later, or Windows Vista or later are not affected.
fr: Les utilisateurs de Windows XP SP2 ou plus, ou Windows Vista ou plus ne sont pas affectés.

source: Change the username and password to the appropriate values for your system.
fr: Changez le nom d'utilisateur et le mot de passe pour des valeurs appropriées à votre système.

source: Notepad is run under the user previously specified.
fr: Bloc-notes est exécuté sous l'utilisateur spécifié.

source: Close the Notepad process using the PID returned by RunAs.
fr: Ferme le processus Notepad en utilisant le PID renvoyée par RunAs.

source: Runs an external program under the context of a different user and pauses script execution until the program finishes.
fr: Exécute un programme externe dans le contexte d'un autre utilisateur et interrompt l'exécution du script jusqu'à ce que le programme se termine.

source: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = The child console process should be created with its own window instead of using the parent's window.
fr: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = Le processus de la console de l'enfant doit être créé avec sa propre fenêtre au lieu d'utiliser la fenêtre du parent.

source: the exit code of the program that was run.
fr: Retourne le code de sortie du programme qui a été exécuté.

source: After running the requested program the script pauses until the program terminates.
fr: Après avoir lancé le programme demandé le script se met en pause jusqu'à la fin du programme.

source: To run a program and then immediately continue script execution use the RunAs() function instead.
fr: Pour exécuter un programme puis continuer immédiatement l'exécution de script utilise la fonction RunAs() à la place.

source: Some programs will appear to return immediately even though they are still running; these programs spawn another process - you may be able to use the ProcessWaitClose() function to handle these cases.
fr: Certains programmes semble retourner immédiatement, même si ils sont encore en cours d'exécution; ces programmes engendrent un autre processus - vous pourriez être en mesure d'utiliser la fonction ProcessWaitClose() pour traiter ce cas.

source: Run Notepad and wait for the Notepad process to close.
fr: Lance le Bloc-notes et attend que le processus du Bloc-notes se ferme.

source: Display the return code of the Notepad process.
fr: Affiche le code de retour du processus du Bloc-notes.

source: Runs an external program and pauses script execution until the program finishes.
fr: Exécute un programme externe et interrompt l'exécution du script jusqu'à ce que le programme se termine.

source: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = The child console process should be created with its own window instead of using the parents window.
fr: 0x10000 ($RUN_CREATE_NEW_CONSOLE) = Le processus de la console de l'enfant doit être créé avec sa propre fenêtre au lieu d'utiliser la fenêtre des parents.

source: To run DOS commands, try RunWait(@ComSpec & " /c " & "commandName") ; don't forget " " before "/c"
fr: Pour exécuter des commandes DOS, essayez RunWait(@ComSpec & " /C " et "commandName") ; ne pas oublier " " avant "/c"

source: To run a program and then immediately continue script execution use the Run() function instead.
fr: Pour exécuter un programme puis continuer immédiatement l'exécution de script utilisez la fonction Run() à la place.

source: ScreenCapture user defined functions Reference
fr: ScreenCapture - Référence

source: When using them you need to add a #include <ScreenCapture.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <ScreenCapture.au3>.

source: Security user defined functions Reference
fr: Security - Référence

source: When using them you need to add a #include <Security.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <Security.au3>.

source: The sequence of keys to send.
fr: La séquence de touches à envoyer.

source: 0 = Text contains special characters like + and !
fr: 0 = Le texte contient des caractères spéciaux comme + et !

source: to indicate SHIFT and ALT key-presses (default).
fr: qui sont utilisés pour indiquer les touches SHIFT et ALT (défaut).

source: See the Appendix for some tips on using Send().
fr: Consultez l'Appendice pour quelques astuces d'utilisation de Send().

source: AutoIt can send all ASCII and Extended ASCII characters (0-255).To send UNICODE characters you must use the "ASC" option and the code of the character you wish to send (see {ASC} at the bottom of the table below).
fr: AutoIt peut envoyer tous les caractères ASCII et ASCII étendu (0-255).Pour envoyer des caractères UNICODE, vous devez utiliser l'option "ASC" et le code du caractère que vous voulez envoyer (voir {ASC} au bas de la table ci-dessous).

source: The "Send()" command syntax is similar to that of ScriptIt and the Visual Basic "SendKeys" command.
fr: La syntaxe de la commande Send() est similaire à celle de ScriptIt et à celle de la commande "SendKeys" en Visual Basic.

source: Characters are sent as written with the exception of the following characters:
fr: Les caractères sont envoyés tels qu'ils sont écrits à l'exception des caractères suivants:

source: This tells AutoIt to send an ALT keystroke, therefore Send("This is text!a") would send the keys "This is text" and then press "ALT+a".
fr: Ce caractère dit à AutoIt de simuler l'appui de la touche ALT.Par exemple, Send()("Ceci est un texte!a") va envoyer les touches "Ceci est un texte" puis presser "ALT+a".

source: N.B.
fr: Remarque :

source: Some programs are very choosy about capital letters and ALT keys, i.e.,
fr: Certains programmes sont très difficiles quand à l'utilisation des lettres majuscules combinées avec l'appui sur ALT.

source: "!A" is different from "!a".
fr: Par exemple, "!A" est différent de "!a".

source: The first says ALT+SHIFT+A, the second is ALT+a.
fr: Le premier code dit ALT+SHIFT+A et le deuxième ALT+a.

source: If in doubt, use lowercase!
fr: Si vous avez un doute, utilisez les minuscules!

source: This tells AutoIt to send a SHIFT keystroke; therefore, Send("Hell+o") would send the text "HellO".
fr: Ce caractère dit à AutoIt de simuler l'appui de la touche SHIFT.

source: Send("!+a") would send "ALT+SHIFT+a".
fr: Par exemple, Send()("Hell+o") va envoyer le texte "HellO", et Send()("!+a") va envoyer "ALT+SHIFT+a".

source: This tells AutoIt to send a CONTROL keystroke; therefore, Send("^!a") would send "CTRL+ALT+a".
fr: Ce caractère dit à AutoIt de simuler l'appui de la touche CTRL.Par exemple, Send()("^!a") va envoyer "CTRL+ALT+a".

source: Some programs are very choosy about capital letters and CTRL keys, i.e.,
fr: Certains programmes sont très difficiles quand à l'utilisation des lettres majuscules combinées avec l'appui sur CTRL.

source: "^A" is different from "^a".
fr: Par exemple, "^A" est différent de "^a".

source: The first says CTRL+SHIFT+A, the second is CTRL+a.
fr: Le premier code dit CTRL+SHIFT+A et le deuxième CTRL+a.

source: The hash now sends a Windows keystroke; therefore, Send("#r") would send Win+r which launches the Run() dialog box.
fr: Ce caractère dit à AutoIt de simuler l'appui de la touche Windows.Par exemple, Send("#r") va envoyer Win+r qui va lancer la boîte de dialogue 'Exécuter' de Windows.

source: You can set SendCapslockMode to make CAPS LOCK disabled at the start of a Send() operation and restored upon completion.
fr: Vous pouvez utiliser SendCapslockMode pour désactiver le verrouillage majuscule au début de chaque utilisation de Send() et le réactiver à la fin.

source: However, if a user is holding down the Shift key when a Send() function begins, text may be sent in uppercase.
fr: Cependant, si un utilisateur maintient l'appui sur SHIFT au démarrage de la fonction Send(), le texte peut être envoyé en majuscule.

source: One workaround is to Send("{SHIFTDOWN}{SHIFTUP}") before the other Send() operations.
fr: Une manière de contourner est d'utiliser Send()("{SHIFTDOWN}{SHIFTUP}") avant les autres utilisations de Send().

source: Certain keyboards as the Czech keyboard sends different characters when using the Shift Key or with CAPS LOCK enabled while sending a character.
fr: Certains claviers comme le Tchèque envoient des caractères différents lors de l'appui sur la touche Shift ou pendant que le VERROUILLAGE MAJUSCULE est activé.

source: Due to the send AutoIt implementation the CAPS LOCKed character will be sent as a Shifted character so it will not work.
fr: En raison du fonctionnement de la fonction Send, (les caractères majuscules sont envoyés comme des minuscules affublées d'un SHIFT) l'envoi des majuscules ne marchera pas.

source: Certain special keys can be sent and should be enclosed in braces:
fr: Certains caractères spéciaux peuvent être envoyés mais doivent être encadrés de crochets.

source: Windows does not allow the simulation of the "CTRL-ALT-DEL" combination!
fr: Windows n'autorise pas la simulation de la combinaison "CTRL-ALT-DEL"!

source: Send() Command (if zero flag)
fr: Commande Send() (Si flag = 0)

source: Resulting Keypress
fr: Caractères envoyés

source: SPACE
fr: Espace

source: ENTER key on the main keyboard
fr: Touche ENTRÉE du clavier principal

source: BACKSPACE
fr: RETOUR ARRIÈRE

source: DELETE
fr: SUPPRIMER

source: Up arrow
fr: Flèche haut

source: Down arrow
fr: Flèche bas

source: Left arrow
fr: Flèche gauche

source: Right arrow
fr: Flèche droite

source: END
fr: FIN

source: ESCAPE
fr: ÉCHAP

source: INS
fr: INSÉRER

source: Function keys
fr: Touches de fonctions

source: TAB
fr: Tabulation

source: Print Screen key
fr: Impr.Écran

source: Left Windows key
fr: Touche Windows de gauche

source: Right Windows key
fr: Touche Windows de droite

source: NUMLOCK (on/off/toggle)
fr: Pavé Numérique (on/off/basculement)

source: CAPSLOCK (on/off/toggle)
fr: Verrouillage Majuscule (on/off/basculement)

source: SCROLLLOCK (on/off/toggle)
fr: SCROLLLOCK (on/off/basculement)

source: for Ctrl+Break processing
fr: Pour Ctrl+Break du traitement

source: Numpad digits
fr: Chiffres du pavé numérique

source: Numpad Multiply
fr: Multiplication du pavé numérique

source: Numpad Add
fr: Addition du pavé numérique

source: Numpad Subtract
fr: Soustraction du pavé numérique

source: Numpad Divide
fr: Division du pavé numérique

source: Numpad period
fr: Point du pavé numérique

source: Enter key on the numpad
fr: Touche ENTRÉE du pavé numérique

source: Windows App key
fr: Touche des applications Windows

source: Left ALT key
fr: Alt gauche

source: Right ALT key
fr: Alt droit

source: Left CTRL key
fr: Ctrl gauche

source: Right CTRL key
fr: Ctrl droit

source: Left Shift key
fr: Shift gauche

source: Right Shift key
fr: Shift droit

source: Computer SLEEP key
fr: Touche de mise hors tension de l'ordinateur

source: Holds the ALT key down until {ALTUP} is sent
fr: Maintient appuyé la touche ALT jusqu'à l'envoi de la touche {ALTUP}

source: Holds the SHIFT key down until {SHIFTUP} is sent
fr: Maintient appuyé la touche SHIFT jusqu'à l'envoi de la touche {SHIFTUP}

source: Holds the CTRL key down until {CTRLUP} is sent
fr: Maintient appuyé la touche CTRL jusqu'à l'envoi de la touche {CTRLUP}
